# ####################################################################

#  Created by Genus(TM) Synthesis Solution 16.10-p006_1 on Wed Mar 08 20:08:47 -0800 2017

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design rockettile_x2

create_clock -name "clk" -add -period 6.0 -waveform {0.0 3.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_prci_interrupts_msip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_prci_interrupts_mtip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_prci_interrupts_debug]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_prci_interrupts_seip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_prci_interrupts_meip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_prci_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_prci_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_prci_reset]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_grant_bits_manager_xact_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_grant_bits_manager_xact_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_grant_bits_manager_xact_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_grant_bits_manager_xact_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_uncached_0_acquire_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_finish_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_grant_bits_manager_id]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_grant_bits_manager_xact_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_grant_bits_manager_xact_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_grant_bits_manager_xact_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_grant_bits_manager_xact_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_release_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_p_type[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_p_type[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_probe_bits_addr_block[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_probe_valid]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_acquire_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_prci_interrupts_msip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_prci_interrupts_mtip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_prci_interrupts_debug]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_prci_interrupts_seip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_prci_interrupts_meip]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_prci_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_prci_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_prci_reset]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_data[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_g_type[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_g_type[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_g_type[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_g_type[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_uncached_0_grant_bits_is_builtin_type]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_manager_xact_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_manager_xact_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_manager_xact_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_manager_xact_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_uncached_0_grant_bits_client_xact_id]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_addr_beat[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_addr_beat[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_grant_bits_addr_beat[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_uncached_0_grant_valid]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_uncached_0_acquire_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_finish_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_grant_bits_manager_id]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_data[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_g_type[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_g_type[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_g_type[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_g_type[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_grant_bits_is_builtin_type]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_manager_xact_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_manager_xact_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_manager_xact_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_manager_xact_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_grant_bits_client_xact_id]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_addr_beat[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_addr_beat[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_grant_bits_addr_beat[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_grant_valid]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_release_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_p_type[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_p_type[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_probe_bits_addr_block[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_probe_valid]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_acquire_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clk]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_uncached_0_grant_ready]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_data[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_union[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_a_type[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_a_type[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_a_type[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_uncached_0_acquire_bits_is_builtin_type]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_beat[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_beat[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_beat[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_uncached_0_acquire_bits_client_xact_id]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_uncached_0_acquire_bits_addr_block[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_uncached_0_acquire_valid]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_finish_bits_manager_id]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_finish_bits_manager_xact_id[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_finish_bits_manager_xact_id[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_finish_bits_manager_xact_id[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_finish_bits_manager_xact_id[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_finish_valid]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_grant_ready]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_data[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_r_type[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_r_type[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_r_type[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_release_bits_voluntary]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_release_bits_client_xact_id]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_block[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_beat[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_beat[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_release_bits_addr_beat[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_release_valid]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_probe_ready]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_data[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_union[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_a_type[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_a_type[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_a_type[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_acquire_bits_is_builtin_type]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_beat[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_beat[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_beat[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_acquire_bits_client_xact_id]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile2_io_cached_0_acquire_bits_addr_block[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile2_io_cached_0_acquire_valid]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_uncached_0_grant_ready]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_union[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_uncached_0_acquire_bits_addr_block[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_finish_bits_manager_id]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_finish_bits_manager_xact_id[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_finish_bits_manager_xact_id[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_finish_bits_manager_xact_id[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_finish_bits_manager_xact_id[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_finish_valid]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_grant_ready]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_data[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_r_type[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_r_type[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_r_type[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_release_bits_voluntary]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_release_bits_client_xact_id]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_block[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_beat[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_beat[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_release_bits_addr_beat[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_release_valid]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tile1_io_cached_0_probe_ready]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_union[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tile1_io_cached_0_acquire_bits_addr_block[25]}]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells RocketTile_1/RocketTile_1]
