# ####################################################################

#  Created by Genus(TM) Synthesis Solution 16.10-p006_1 on Mon Feb 27 23:22:57 -0800 2017

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1.0fF
set_units -time 1000.0ps

# Set the current design
current_design des3_perf_opt

create_clock -name "clk" -add -period 2.0 -waveform {0.0 1.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clk]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports decrypt]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key3[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key2[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {key1[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desIn[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {desOut[63]}]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells des/des]
